Nick Carroll, Yueyin Su
<br>
Unifying Data Science
<br>
Estimating Gender Discrimination in the Workplace

Exercise 1: Loading Data

In [1]:
import pandas as pd
data = pd.read_stata('https://github.com/nickeubank/MIDS_Data/raw/master/Current_Population_Survey/morg18.dta')

Exercise 2: Subsetting Data

Data is subset for people who are full time and employed.

In [2]:
subset = data.loc[(data.loc[:, 'lfsr94'] == 'Employed-At Work') & (data.loc[:, 'uhourse'] >= 35), :]

Exercise 3: Basic Wage Gap Estimate

In [ ]:
subset.loc[:, 'uhourse'].unique()

array([40., 36., 48., 35., 44., 50., 45., 60., 41., 70., 75., 80., 56.,
       96., 82., 38., 55., 52., 77., 84., 42., 43., 54., 53., 65., 37.,
       72., 61., 99., 58., 47., 63., 46., 39., 49., 66., 57., 90., 62.,
       85., 87., 68., 69., 76., 83., 98., 51., 78., 64., 67., 92., 95.,
       74., 88., 86., 81., 59., 71., 73., 91., 89., 94.])

In [4]:
%%capture --no-display
subset.loc[:, 'average hourly rate'] = subset.loc[:, 'earnwke'] / subset.loc[:, 'uhourse']

In [6]:
men_subset = subset.loc[subset.loc[:, 'sex'] == 1]
women_subset = subset.loc[subset.loc[:, 'sex'] == 2]

In [7]:
# checking about missing values
print(men_subset.loc[:, 'average hourly rate'].isna().sum())
print(women_subset.loc[:, 'average hourly rate'].isna().sum())

7946
3265

In [13]:
print("The gender wage gap is:",men_subset.loc[:, 'average hourly rate'].mean()- women_subset.loc[:, 'average hourly rate'].mean())

The gender wage gap is: 4.080172337386848

In [ ]:
subset.loc[subset.loc[:, 'earnwke'].isna(), ['earnwke', 'uhourse', 'average hourly rate', 'lfsr94', 'sex']]

        earnwke  uhourse  average hourly rate            lfsr94  sex
89          NaN     50.0                  NaN  Employed-At Work    1
108         NaN     40.0                  NaN  Employed-At Work    1
167         NaN     60.0                  NaN  Employed-At Work    1
169         NaN     40.0                  NaN  Employed-At Work    1
306         NaN     60.0                  NaN  Employed-At Work    1
...         ...      ...                  ...               ...  ...
302226      NaN     60.0                  NaN  Employed-At Work    2
302300      NaN     50.0                  NaN  Employed-At Work    1
302310      NaN     50.0                  NaN  Employed-At Work    1
302314      NaN     50.0                  NaN  Employed-At Work    1
302326      NaN     47.0                  NaN  Employed-At Work    1

[11211 rows x 5 columns]